using UnityEngine;
using System.Collections;

public class ResearchTools : MonoBehaviour {
    //в классе информация о исследовательских инструментах
    // и методы для просчета вероятностей открытия рецептов


    //Ступка-Дистилятор.
    // реализовать покупку ступки нового грейда
    // метод добавления ингредиента в ступку
    // метод начала исследования 
    // по завершении процесса исследавния выдать результат в виде всплывающего сообщения на игровом екране
    // от грейда ступки зависит коефициент успешности исследования и вместимость (10,20,30,40)

    int mortar1 = 1;
    int distiller = 1;
    

    //Смеситель
    //Реализовать методы добавления первого и второго ингредиента
    //При нажатии на кнопку соеденить проверить по базе на наличие рецепта.и возврат результата в случае успеха в добавлении нового ингредиента в инентарь
    // и во всех случаях вывод всплывающего сообщения о результате смешивания.
    //кнопка очистки для очистки поля для ингредиентов

    
}
