using UnityEngine;
using System.Collections;

public class ЕNewBehaviourScript : MonoBehaviour {

	//1. Обновление торговца каждых 5 минут
    //2. Пополнение товаров до определенного количества
    //3. Открытие новых товаров которые были исследованы
    //4. Отображаются только открытые ингридиенты и доступные по грейду инструменты
    //5. Открытые при исследованиях ингредиенты стают доступными для покупик после обновления

    //****Типы товаров*****
    //1.Ингредиенты
    //2. Инструменты готовки(котлы , ложки, нагреватели, катализатор)
    //3. Инструменты для исследования(ступки, дистиляторы, смешиватели)
}
